geval-jar/src/test/resources/berichten/geval-emails-antwoord.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soap:Body>
        <GevalAntwoord
                xmlns="http://xmlns.rotterdam.nl/geval/operations/v1"
                xmlns:ns2="http://xmlns.rotterdam.nl/geval/v1" xmlns:ns3="http://rotterdam.nl/schemas/identify/2.0/">
            <CheckResult>
                <ns2:Type>e-mail</ns2:Type>
                <ns2:Gegeven>g..bruiker@rotterdam.nl</ns2:Gegeven>
                <ns2:Validatie>fout</ns2:Validatie>
                <ns2:Detail>INVALIDE_SYNTAX_GEBRUIKER</ns2:Detail>
            </CheckResult>
            <CheckResult>
                <ns2:Type>e-mail</ns2:Type>
                <ns2:Gegeven>g.e.bruiker@rotterdam.nl</ns2:Gegeven>
                <ns2:Validatie>goed</ns2:Validatie>
                <ns2:Detail>DOMEIN_MET_EMAIL</ns2:Detail>
            </CheckResult>
        </GevalAntwoord>
    </soap:Body>
</soap:Envelope>